---
title: "插入排序"
date: 2023-02-26T21:35:31+08:00
summary: "将待排序数插入到已经排好的有序区的合适位置"
categories: ["Python","算法"]
tags: [""]
---

#+begin_src python :results output
nums = [1, 9, 8, 5, 6]
nums = [None]+nums
length = len(nums)

for i in range(2, length):
    nums[0] = nums[i]
    j = i-1
    if nums[j] > nums[0]:
        while nums[j] > nums[0]:
            nums[j+1] = nums[j]
            j -= 1
        nums[j+1] = nums[0]
print(nums[1:])
#+end_src

#+RESULTS:
: [1, 5, 6, 8, 9]
